docs/mathematics/single_variable_calculus/KBe21math401retLinearApproxAndDefferentials.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-02 Sat 12:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Exr0n" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>

</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title"></h1> <h2 class="subtitle"></h2> <span class="author">Exr0n</span> <span class="date">2021-10-02 Sat 10:58</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul></ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org3255ef9">1. linear approximations</a>
<ul>
<li><a href="#org2f1a001">1.1. cube root</a>
<ul>
<li><a href="#org8d078f3">1.1.1. approximation</a></li>
<li><a href="#org03315fe">1.1.2. estimations</a></li>
</ul>
</li>
<li><a href="#org9e2b734">1.2. sin(x)</a>
<ul>
<li><a href="#orgf5f5d0a">1.2.1. approximation</a></li>
<li><a href="#org64131f3">1.2.2. estimates</a></li>
</ul>
</li>
<li><a href="#orga1bac19">1.3. unknown function (only some points known</a>
<ul>
<li><a href="#org2fccf6f">1.3.1. approximation</a></li>
<li><a href="#org4a23852">1.3.2. estimations</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org667fd0c">2. differentials</a>
<ul>
<li><a href="#org8f044a5">2.1. cube error</a>
<ul>
<li><a href="#org8b8494e">2.1.1. differential</a></li>
<li><a href="#orgaf16eb3">2.1.2. volume error</a></li>
<li><a href="#org210b6d1">2.1.3. max error for some \(\epsilon\)</a></li>
</ul>
</li>
<li><a href="#org7c216a6">2.2. sphere measuring</a></li>
</ul>
</li>
</ul>
</div></div>
</div>

<div id="outline-container-org3255ef9" class="outline-2">
<h2 id="org3255ef9"><span class="section-number-2">1</span> linear approximations</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2f1a001" class="outline-3">
<h3 id="org2f1a001"><span class="section-number-3">1.1</span> cube root</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org8d078f3" class="outline-4">
<h4 id="org8d078f3"><span class="section-number-4">1.1.1</span> approximation</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
\[ (1+x)^{\frac{1}{3}} \to \frac{1}{3} (1+x)^{\frac{-2}{3}} \]
at \(x = 0\) is
\[ \frac{1}{3} (1+0) ^ {\text{...}} = \frac{1}{3} \]
so the linear approximation is
\[ y \approx m(x-0)+f(0) = \frac{1}{3}x+1 \]
</p>
</div>
</div>
<div id="outline-container-org03315fe" class="outline-4">
<h4 id="org03315fe"><span class="section-number-4">1.1.2</span> estimations</h4>
<div class="outline-text-4" id="text-1-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">value</th>
<th scope="col" class="org-right">estimate</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0.05</td>
<td class="org-right">1.016666</td>
</tr>

<tr>
<td class="org-right">-0.25</td>
<td class="org-right">0.916666</td>
</tr>
</tbody>
</table>

<p>
These will be overestimates because the graph is concave down in this reigon.
</p>
</div>
</div>
</div>

<div id="outline-container-org9e2b734" class="outline-3">
<h3 id="org9e2b734"><span class="section-number-3">1.2</span> sin(x)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf5f5d0a" class="outline-4">
<h4 id="orgf5f5d0a"><span class="section-number-4">1.2.1</span> approximation</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
\[ y \approx \frac{d}{dx} \sin x \Bigr|_0 (x-0) + \sin 0 = x \]
</p>
</div>
</div>

<div id="outline-container-org64131f3" class="outline-4">
<h4 id="org64131f3"><span class="section-number-4">1.2.2</span> estimates</h4>
<div class="outline-text-4" id="text-1-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">value</th>
<th scope="col" class="org-right">estimate</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">-0.1</td>
<td class="org-right">-0.1</td>
</tr>

<tr>
<td class="org-right">0.1</td>
<td class="org-right">0.1</td>
</tr>
</tbody>
</table>

<p>
The first estimate will be an underestimate because \(\sin x\) is concave up in that reigon. The opposite is true for the second estimate.
</p>
</div>
</div>
</div>

<div id="outline-container-orga1bac19" class="outline-3">
<h3 id="orga1bac19"><span class="section-number-3">1.3</span> unknown function (only some points known</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org2fccf6f" class="outline-4">
<h4 id="org2fccf6f"><span class="section-number-4">1.3.1</span> approximation</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
\[ y \approx \frac{d}{dx} f(x) \Bigr|_c (x-c) + f(c) \]
plugging in \(c = 1\),
\[ y \approx 5(x-1)-4 \]
</p>
</div>
</div>

<div id="outline-container-org4a23852" class="outline-4">
<h4 id="org4a23852"><span class="section-number-4">1.3.2</span> estimations</h4>
<div class="outline-text-4" id="text-1-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">value</th>
<th scope="col" class="org-right">estimate</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1.2</td>
<td class="org-right">-3</td>
</tr>
</tbody>
</table>

<p>
This will be an underestimate because the second derivative is positive and the graph is thus concave up.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-org667fd0c" class="outline-2">
<h2 id="org667fd0c"><span class="section-number-2">2</span> differentials</h2>
<div class="outline-text-2" id="text-2">
<p>
For a function \(y = f(x)\), \(dy\) and \(dx\) are diferentials and the relationship is \(dy = f'(x) dx = \frac{L(a+\Delta a)-L(a)}{\cancel{dx}} \cancel{dx}\).
</p>

<p>
For a function written \(f(x) = \text{(something)}\), the differentials are \(df\) and \(dx\) and the relationship is the same: \(df = f'(x) dx\).
</p>
</div>

<div id="outline-container-org8f044a5" class="outline-3">
<h3 id="org8f044a5"><span class="section-number-3">2.1</span> cube error</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org8b8494e" class="outline-4">
<h4 id="org8b8494e"><span class="section-number-4">2.1.1</span> differential</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
\[\begin{split}df &= f'(x) dx\\ &= 3x^2 dx\end{split}\]
</p>
</div>
</div>

<div id="outline-container-orgaf16eb3" class="outline-4">
<h4 id="orgaf16eb3"><span class="section-number-4">2.1.2</span> volume error</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
If I understand the use of differentials corretly, then \(x\) is the measured value (\(2\)) and \(dx\) is the uncertainty (delta x), or \(0.2 \text{ft}\).
Then, the change in the volume (change in fuction or \(df\)) would be \(3(2)^2 (0.2) = 2.4\)
</p>
</div>
</div>

<div id="outline-container-org210b6d1" class="outline-4">
<h4 id="org210b6d1"><span class="section-number-4">2.1.3</span> max error for some \(\epsilon\)</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
\[
</p>
 \begin{aligned}
 df &\approx 3x^2 dx\\
 dx &\approx \frac{df}{3x^2}\\
&\approx \frac{1}{3(2)^2}\\
&\approx \frac{1}{12} \text{ ft} = 1 \text{in}
 \end{aligned}
<p>
\]
</p>
</div>
</div>
</div>

<div id="outline-container-org7c216a6" class="outline-3">
<h3 id="org7c216a6"><span class="section-number-3">2.2</span> sphere measuring</h3>
<div class="outline-text-3" id="text-2-2">
<p>
\[
</p>
\begin{aligned}
f(r) &= \frac{4}{3}\pi r^3\\
\frac{df}{dr} &= 4\pi r^2\\
df &= 4\pi r^2 (dr)\\
&= 4\pi 21^2 (0.05) = \pm88.4 \pi \text{ cm}^3
\end{aligned}
<p>
\]
</p>
</div>
</div>
</div>
</div>
</body>
</html>
