docs/mathematics/single_variable_calculus/KBe21math401retLinearApproxAndDefferentials.tex
% Created 2021-09-11 Sat 16:43
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Exr0n}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Exr0n},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}


\section{linear approximations}
\label{sec:org854ad44}

\subsection{cube root}
\label{sec:org4ee12f9}

\subsubsection{approximation}
\label{sec:org0755909}
\[ (1+x)^{\frac{1}{3}} \to \frac{1}{3} (1+x)^{\frac{-2}{3}} \]
at \(x = 0\) is
\[ \frac{1}{3} (1+0) ^ {\text{...}} = \frac{1}{3} \]
so the linear approximation is
\[ y \approx m(x-0)+f(0) = \frac{1}{3}x+1 \]
\subsubsection{estimations}
\label{sec:org121a58a}
\begin{center}
\begin{tabular}{rr}
value & estimate\\
\hline
0.05 & 1.016666\\
-0.25 & 0.916666\\
\end{tabular}
\end{center}

These will be overestimates because the graph is concave down in this reigon.

\subsection{sin(x)}
\label{sec:orgbda2909}

\subsubsection{approximation}
\label{sec:org51fa52f}
\[ y \approx \frac{d}{dx} \sin x \Bigr|_0 (x-0) + \sin 0 = x \]

\subsubsection{estimates}
\label{sec:org1f8b49a}
\begin{center}
\begin{tabular}{rr}
value & estimate\\
\hline
-0.1 & -0.1\\
0.1 & 0.1\\
\end{tabular}
\end{center}

The first estimate will be an underestimate because \(\sin x\) is concave up in that reigon. The opposite is true for the second estimate.

\subsection{unknown function (only some points known}
\label{sec:org3b9f617}

\subsubsection{approximation}
\label{sec:org872f659}
\[ y \approx \frac{d}{dx} f(x) \Bigr|_c (x-c) + f(c) \]
plugging in \(c = 1\),
\[ y \approx 5(x-1)-4 \]

\subsubsection{estimations}
\label{sec:org0dbe49f}
\begin{center}
\begin{tabular}{rr}
value & estimate\\
\hline
1.2 & -3\\
\end{tabular}
\end{center}

This will be an underestimate because the second derivative is positive and the graph is thus concave up.



\section{differentials}
\label{sec:org02f7952}
For a function \(y = f(x)\), \(dy\) and \(dx\) are diferentials and the relationship is \(dy = f'(x) dx = \frac{L(a+\Delta a)-L(a)}{\cancel{dx}} \cancel{dx}\).

For a function written \(f(x) = \text{(something)}\), the differentials are \(df\) and \(dx\) and the relationship is the same: \(df = f'(x) dx\).

\subsection{cube error}
\label{sec:org6bc8d93}

\subsubsection{differential}
\label{sec:org53e7ba0}

\[\begin{split}df &= f'(x) dx\\ &= 3x^2 dx\end{split}\]

\subsubsection{volume error}
\label{sec:org61d8f86}
If I understand the use of differentials corretly, then \(x\) is the measured value (\(2\)) and \(dx\) is the uncertainty (delta x), or \(0.2 \text{ft}\).
Then, the change in the volume (change in fuction or \(df\)) would be \(3(2)^2 (0.2) = 2.4\)

\subsubsection{max error for some \(\epsilon\)}
\label{sec:org09081ac}
$\backslash$[
 \begin{aligned}
 df &\approx 3x^2 dx\\
 dx &\approx \frac{df}{3x^2}\\
&\approx \frac{1}{3(2)^2}\\
&\approx \frac{1}{12} \text{ ft} = 1 \text{in}
 \end{aligned}
$\backslash$]

\subsection{sphere measuring}
\label{sec:orgb66d651}
$\backslash$[
\begin{aligned}
f(r) &= \frac{4}{3}\pi r^3\\
\frac{df}{dr} &= 4\pi r^2\\
df &= 4\pi r^2 (dr)\\
&= 4\pi 21^2 (0.05) = \pm88.4 \pi \text{ cm}^3
\end{aligned}
$\backslash$]
\end{document}
